//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#pragma once
#include "Game.h"
#include "UIScreen.h"


///////////////////////////////////////////////////////////////////////////////
//class
///////////////////////////////////////////////////////////////////////////////
class GameClear : public UIScreen
{
public:
	//Enum State
	enum State {
		EMainMenu,
		EGameplay,
		EPaused,
		EQuit
	};

	//=========================================================================
	// public methods.
	//=========================================================================
	//コンストラクタ
	GameClear(class Game* game);

    //デストラクタ
	~GameClear();

	//入力
	void HandleKeyPress(int key) override;
};
