//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#pragma once
#include "Game.h"
#include "UIScreen.h"


///////////////////////////////////////////////////////////////////////////////
//class
///////////////////////////////////////////////////////////////////////////////
class GameOver : public UIScreen
{
public:
	//Enum State
	enum State {
		EMainMenu,
		EGameplay,
		EPaused,
		EQuit
	};
	//=========================================================================
	// public methods.
	//=========================================================================
	//コンストラクタ
	GameOver(class Game* game);
	//デストラクタ
	~GameOver();

	//入力
	void HandleKeyPress(int key) override;
};
